{"183": {"QId": 183, "QTitle": "Cutting boards: What are some general tips on purchasing and using a cutting board?", "QBody": "I have heard various debates on the merits of wood versus synthetic cutting boards, and their affect on food safety, knife edges, and ease of cleaning and storage.\n\nWhat are the pros and cons of the following and why?\n\n\nWood versus plastic or other materials\nAffect on food safety and cleanliness\nCost to purchase\nAffect on knife edge and ease of use\n\n", "Ans": [{"GId": 202, "GBody": "I use two types of cutting boards: wood and [soft] plastic. The plastic is for meat, or anything that could ruin a wood cutting board. Wood is for everything else. If you can afford it, try to get an end-grain wood cutting board.\n\nBamboo is a popular choice right now (it's affordable and sustainable), but I don't have any personal experience with it.\n\nMost other materials, especially glass, will ruin your knives.\n", "GScore": 11, "answer_query_sim": 0.7352999167309867, "answer_answer_sim": 0.8314099687117117, "selected": 0}, {"GId": 205, "GBody": "Don't use a glass board. It dulls the edge of the knife and the food you are trying to cut is more likely to slip than on a wood/plastic board.\n", "GScore": 7, "answer_query_sim": 0.7384155790011088, "answer_answer_sim": 0.8310679114527173, "selected": 0}, {"GId": 685, "GBody": "Besides the material itself, there are lots of other factors -- \n\nSurface : There are smooth plastic cutting boards, and there are rougher ones.  I prefer the rougher ones, as smooth means things are slipping all over the place and its can be dangerous.  Plastic will roughen up with use, but cuts and nicks in plastic boards means more places for germs.  For those thin plastic cutting mats, they're so lightweight that you have to worry about both the food sliding, and the mat itself sliding.\n\nThickness : Those 'butcher block' wooden boards look great, but I don't like them for two reasons: I'm short, and it raises the surface that I'm cutting at; they're heavier, and I like being able to pick up my cutting board to take to my stove, as my cutting area is near my sink, not my stove.\n\nSize : Large enough to hold the amount of food you tend to prep at one time, and not so overly large that it's a pain to move / clean / etc.  I like about 18\" x 24\" (45cm x 60cm), but if you're cooking for one in a small apartment, that might be a little large.  (although, one of my apartments was small enough that I used a large board, so I could span the sink, as there was all of maybe 30\" (75cm) of counter space.\n\nAll this being said -- I use wood for all vegetables, and plastic cutting mats for meats and poultry, just because it saves me time sanitizing everything between cutting.  (although, I typically try to cut all of the vegetables first, then the meat, just to save on cleaning a knife).\n\nPart of the complaint against wood is that it's very hard to get germs out once they get into wood -- but research has shown that if you clean the surface, wood cutting boards are unlikely to transfer germs to other food, and a well-maintained wooden cutting board will self-heal and continues to be safe over time, whereas plastic can't be simply wiped down once it starts developed scratches from use.  To sanitize wood boards, use half a lemon, and coarse salt (I use kosher salt), and use the cut side to scrub the board.  Rinse, let it dry, and give it some food-grade mineral oil every few months, depending on how humid your area is.  If it's looking sad, you can always sand it down, re-sanitize it and re-oil it.\n", "GScore": 14, "answer_query_sim": 0.7454218105191276, "answer_answer_sim": 0.8345316414322171, "selected": 1}, {"GId": 15409, "GBody": "How about something on the edge of the board (like a soft rubber \"fence\" maybe .5\" tall) that keeps the food from falling off.  I realize this is tricky b/c you don't want the \"fence\" to interfere w/ the cutting. But it drives me nuts that food is always falling off the edge (just a tiny amount but enough to make a mess).\n", "GScore": 1, "answer_query_sim": 0.7360585530598959, "answer_answer_sim": 0.8296882999006403, "selected": 0}], "QTags": "<equipment><knives><cutting><chopping><cutting-boards>"}, "184": {"QId": 184, "QTitle": "What knives are \"required\" for a serious home kitchen?", "QBody": "I consider myself a serious home cook. What knives are essential?\n", "Ans": [{"GId": 186, "GBody": "To me, the following are necessary:\n\n\nA chef's knife (8 inch)\nA paring knife\nA bread knife\n\n\nThere are tasks for which other knives are more suitable, but these are the three I started with, and there's little you may need others for.\n", "GScore": 18, "answer_query_sim": 0.801313728094101, "answer_answer_sim": 0.8903853858826027, "selected": 0}, {"GId": 188, "GBody": "\nChef's \nCarving \nSerrated/bread knife\nParing \nFilet\n\n\nThere are plenty more you could use (I love my Santoku), but that will enable you to do just about anything.\n", "GScore": 5, "answer_query_sim": 0.7475536465644836, "answer_answer_sim": 0.850406482154392, "selected": 0}, {"GId": 189, "GBody": "There are three core essentials:\n\n\nChef's knife\n\n8\" or 10\" depending on your preferences\n\nParing knife\n\n3\" or 4\" depending on your preferences\n\nBread knife\n\nAs long as possible, 12\"+\nFeel free to go cheap here, it's serrated and thus largely unsharpenable\n\n\n\nYou may want to check out Alton Brown's book, Alton Brown's Gear For Your Kitchen. He spends a chapter on knives and where to go past the essentials. He also suggests which ones are worth spending money on and which should be throwaways.\n", "GScore": 91, "answer_query_sim": 0.7418840246670606, "answer_answer_sim": 0.8245116767970314, "selected": 1}, {"GId": 199, "GBody": "I use three:\n\n\nChef's knife - sharp, straight blade\nBread knife\nSometimes a serrated knife for tough vegetables\n\n\nBut then I'm a vegetarian, so I don't need to cut meat.\n", "GScore": 4, "answer_query_sim": 0.7501683235168457, "answer_answer_sim": 0.8634851628678599, "selected": 0}, {"GId": 206, "GBody": "I've got a 6\" chef's knife that I find more useful than my 8\" chef\n\nI also love my 8\" Santoku\n", "GScore": 0, "answer_query_sim": 0.7175733745098114, "answer_answer_sim": 0.8215102872988433, "selected": 0}, {"GId": 259, "GBody": "If you could only buy one knife, I would get a French Chef's knife or a Japanese Santoku, probably in the 8 inch size. These knives are both used differently (different techniques) so I would also research how to properly hold and use whichever one you go with.\n", "GScore": 4, "answer_query_sim": 0.7620389312505722, "answer_answer_sim": 0.8586071670293569, "selected": 0}, {"GId": 687, "GBody": "Everyone's stressing the chef's knife, but I'd be even more generic; when starting out, you can do almost every task with:\n\n\nA large knife (8\" Chef, 7\" Japanese Santoku, or a Chinese Cleaver) \nA small knife (Paring or similar)\nA bread knife (serrated, 10\" or longer)\n\n\nAs you add to your collection: \n\n\nA boning / filet knife \nKitchen shears (for snipping herbs without a cutting board or cutting the back out of a chicken)\nA carving knife (for slicing meats and large melons or splitting a cake into layers)\nA heavy cleaver (so you don't mess up your main-line knives when hacking up bones; heavy enough to use the back of the knife for cracking a coconut)\nA utility / tomato knife (mid-sized, serrated)\n\n\nA few people have mentioned a larger chef's knife, but it's going to be harder to control.  Develop good knife skills first, then move to something larger.  \n\nI know a few people who do everything but bread with a paring knife (and no cutting board, in their hand, cutting against their thumb), and I'd consider them \"serious chefs\" (southern, over 60 for the most part, but also a few apartment-living Europeans).\n", "GScore": 48, "answer_query_sim": 0.780323306719462, "answer_answer_sim": 0.8771860570626474, "selected": 1}, {"GId": 14648, "GBody": "Has anybody mentioned a steel? Buy a steel before you buy a good knife. You could buy the best quality knife of the planet but it won't make a lick of difference if you cannot maintain the quality of the edge.\n\nI use a 33cm wooden handle Victorinox chef's knife for most of my work. I steel it several times a day and sharpen it on a wet-dry stone about once a month. Every chef I have worked with who has picked it up has loved it despite being a cheap brand. \n", "GScore": 5, "answer_query_sim": 0.7061106363932291, "answer_answer_sim": 0.8085609999097874, "selected": 0}, {"GId": 64846, "GBody": "A more modern set...\n\nDisclosure: I'm on the board of directors for a high end knife company.\n\nThe traditional advice given to young home cooks has been to get something like:\n\n\n8\" chef's knife\n4\" paring knife\nBread knife (performs a common task that the other knives cannot).\n\n\nHowever, knife materials and home cooking skills have improved quite a bit over the last decade or two so I now advise serious home cooks to use the following:\n\n\n11\" or 12\" chef's knife - Serious cooks typically know how to handle longer blades, and this gives you more workable edge length for cutting large vegetables and meat blocks, and also allows for fewer and cleaner cuts.  The difference in working edge between an 8\" and a 12\" knife is enormous! \n\n\nContemporary steel allows knives to be made at these lengths without sacrificing precision or rigidity because the knife spine no longer has to be thicker to accommodate a longer length.\nA properly designed, modern 10\" or 12\" knife will have an edge profile which allows for good, western-style push/chop-cutting action with good rebound, but still allow the entire edge length to be used effectively for slicing strokes.\n\n5\" to 6.5\" utility knife - For most home kitchens, a utility knife in this range is far more useful than a paring knife.  It's long enough to cut apples, onions, garlic, herbs, and many prep and one-off items, but also short enough that you can accomplish most paring tasks.  The utility knife size is much more maneuverable than a full chef's knife for simple/one-off tasks, and the length allows for a thin and very sharp blade which you will love.  For couples cooking together, this also allows for much better knife sharing since the utility knife has far better task range than a paring knife.\nBread knife\n\n\nThe next few knives I'd suggest after the \"modern trio\" are:\n\n\nLong sujihiki or slicing knife\nBoning knife\n\n\nMy strong suggestion for those on a budget is to save money by not buying #4 and #5, buying a relatively cheap bread knife, and redirect the bulk of your budget to #1 and #2.\n", "GScore": 4, "answer_query_sim": 0.7534798027642242, "answer_answer_sim": 0.8608293356701169, "selected": 0}, {"GId": 64872, "GBody": "Poll-be-poll, so here goes (vegetarian and not formally trained perspective, too):\n\nEssential:\n\n-One (or a couple of them) that is medium sized (~15cm), thin and can be made really sharp, and has a sharp tipped shape that supports rolling/piercing/slicing (Chef/Gyuto, Kiritsuke, labelled-Santoku-but-actually--more-Kiritsuke-like....). Best if no bolster, having a second piercing/scoring tool available in that spot is useful. Second, stainless one recommended if your primary one isn't. Huge isn't better because then it will be awkward to use for paring too, and will make more of your cutting board space unusable for storage or hand placing.\n\n-One medium to big one that can stand abuse (hacking through an inch of something frozen, dealing with winter squash skin, cutting HOT materials... and damn, the can opener just packed it...) - medium-thick cleaver, inexpensive thick santoku or chef....\n\n-A peeler\n\nNice-to-have knife block filler:\n\n-Something ceramic for really reactive stuff (salsify, acidic fruit...)\n\n-Selection of utility/paring knives (I don't like much off-board cutting so these get used rarely)\n\n-Something really long\n\n-Nakiri (see motivational clutter :)\n\n-...yeah, bread and tomato knives if you happen to eat lots of these. A Chef knife can cut these things adequately too :)\n", "GScore": 0, "answer_query_sim": 0.7389719463536691, "answer_answer_sim": 0.8449407987265369, "selected": 0}], "QTags": "<equipment><knives>"}, "190": {"QId": 190, "QTitle": "Proper ratio of Water to Rice", "QBody": "When making rice, what is the proper ratio of water that I should use?\n", "Ans": [{"GId": 192, "GBody": "Totally depends on the rice - I usually read the back of the bag or whatever.\n", "GScore": 2, "answer_query_sim": 0.8894442319869995, "answer_answer_sim": 0.8001866678406008, "selected": 0}, {"GId": 194, "GBody": "There isn't really a simple answer to this question due to the many variables of personal preference, rice type, water hardness, etc.\n\nI suggest buying a proper rice cooker: Zojirushi NP-HBC10 5-1/2-Cup Rice Cooker and Warmer with Induction Heating System, Stainless Steel. (I love mine!)\n\nThe rice cooker has precise instructions and measurements for each type of rice, even the more obscure types.\n", "GScore": 15, "answer_query_sim": 0.8195717185998306, "answer_answer_sim": 0.7215987222532466, "selected": 0}, {"GId": 220, "GBody": "Depends on the rice, of course - here are the most common types:\n\n\nWhite rice: 2:1\nBrown rice: 1.5:1\nJasmine rice: 1.1:1\nWild rice: 4:1, but immediately wash with cold water and drain when done.\n\n", "GScore": 24, "answer_query_sim": 0.883661150932312, "answer_answer_sim": 0.8156280270746747, "selected": 1}, {"GId": 233, "GBody": "We typically eat jasmine rice. For 2 people we use 1/2 c rice to 3/4 c water. After boiling and letting the boiling settle, cook for 7 min.\n", "GScore": 4, "answer_query_sim": 0.7728483478228251, "answer_answer_sim": 0.7371538542280459, "selected": 0}, {"GId": 501, "GBody": "You're better off going with 1\" above the rice as a guide, if you're boiling long grain white rice, rather than a ratio of liquid to rice.  (except minute rice -- my neighbor once asked me your same question, and I later found out she was cooking minute rice ... oops)\n\nIf you're going for paella, where it's a really wide dish, then I go with about 2:1, but some of that liquid might come from tomatoes.\n\nIf I'm cooking risotto, I tend to heat up twice the amount of stock as rice, but I might not use it all -- and if I think I might run out, after adding a ladle of stock to the rice, I'll add some water to heat up so it'll get a chance to warm up.  (and it helps to have some extra liquid left over to deal with reheating leftovers)\n\nAnd mentioning leftovers -- unlike @Dinah, I never cook less than 2c. of rice at a time -- leftovers come in handy for rice salad or nasi goreng (Indonedian-style fried rice), or to package up with whatever the main dish was for lunches the next day.\n", "GScore": 9, "answer_query_sim": 0.8698142713674318, "answer_answer_sim": 0.8190220220018888, "selected": 0}, {"GId": 525, "GBody": "It also depends how you want to cook the rice. Steaming, boiling, in the oven, pilau...\n", "GScore": 0, "answer_query_sim": 0.6710874973195673, "answer_answer_sim": 0.6754257158699986, "selected": 0}, {"GId": 718, "GBody": "For simplicities sake, I go for a ratio of 2:1. If there's still water in the rice after it's cooked, just keep it on the heat with the lid off for a while. \n\nAlso - If you're going to cook rice this way, it's important that you don't stir it whilst cooking. \n", "GScore": 1, "answer_query_sim": 0.8147878249486288, "answer_answer_sim": 0.7526339852710153, "selected": 0}], "QTags": "<rice>"}}